export const courses: Array<string> = [
  "1 курс",
  "2 курс",
  "3 курс",
  "4 курс",
  "5 курс",
  "6 курс",
];

export const speciality: Array<{
  name: string;
  shortForm: string;
  countOfGroups: number;
}> = [
  { name: `Ком'пютерні науки`, shortForm: "ПМІ", countOfGroups: 3 },
  { name: `Системний аналіз`, shortForm: "ПМА", countOfGroups: 2 },
  { name: `Прикладна математика`, shortForm: "ПМП", countOfGroups: 3 },
  { name: `Середня освіта`, shortForm: "ПМО", countOfGroups: 1 },
];

export const lessons: Array<{
  numb: number;
  start: string;
  end: string;
}> = [
  { numb: 1, start: "8:30", end: "9:50" },
  { numb: 2, start: "10:10", end: "11:30" },
  { numb: 3, start: "11:50", end: "13:10" },
  { numb: 4, start: "13:30", end: "14:50" },
  { numb: 5, start: "15:05", end: "16:25" },
  { numb: 6, start: "16:40", end: "18:00" },
  { numb: 7, start: "18:10", end: "19:30" },
];

export const lecturers: Array<{
  name: string;
  lessons: string[];
}> = [
  {
    name: "Горлач Віталій Михайлович",
    lessons: [
      "Організація та обробка електронної інформації (кн, со)",
      "Бази даних та інформаційні системи (кн)",
      "Моделювання еволюційних систем (кн)",
      "Програмування та підтримка веб-застосувань (кн)",
    ],
  },
  {
    name: "Ярошко Сергій Адамович",
    lessons: [
      "Інформаційні технології в освіті (со-ЗФН)",
      "Інформаційні технології в освіті (со)",
      "Логічне та функціональне програмування (інформатика)",
      "Моніторинг та оцінювання якості освіти (со-ЗФН)",
      "Моніторинг та оцінювання якості освіти (со)",
      `Об'єктно-орієнтовна система Smalltalk (кн)`,
      `Об’єктно орієнтоване програмування (са)`,
      "Програмування (кн - 2)",
      "Системне програмування (системний аналіз)",
      "Шаблони проектування (інформатика)",
    ],
  },
  {
    name: "Щербина Юрій Миколайович",
    lessons: [
      "Дискретна математика (кніт, со)",
      `Дискретна математика(122-комп'ютерні науки)`,
      "Марковські процеси та навчання з підкріпленням",
      "Математична логіка (125-кібербезпека)",
      "Машинне навчання (прикладна інформатика)",
      "Методи навчання з підкріпленням (прикладна інформатика)",
    ],
  },
  {
    name: "Олійник Роман Миколайович",
    lessons: [
      "Методи оптимізації (кн)",
      `Технології комп'ютерного моделювання систем (со-)`,
    ],
  },
  {
    name: "Бернакевич Ірина Євстахіївна",
    lessons: [
      "Валідація та верифікація програмних систем",
      "Програмування для мобільних платформ (кн)",
      "Програмування мовою Java (кн)",
      "Технології захисту інформації (кн, co)",
      "Програмне забезпечення (інформатика)",
      "Програмування (кн)",
      "Теорія програмування",
      "Фрактальні методи в інтелектуальному аналізі даних (кн)",
      "Інф.техн. та системи",
    ],
  },
];

export const audiences: Array<{
  numb: string;
  type: string;
}> = [
  { numb: "119a", type: "practice" },
  { numb: "270", type: "practice" },
  { numb: "367", type: "practice" },
  { numb: "116", type: "practice" },
  { numb: "439", type: "lecture" },
  { numb: "111", type: "lecture" },
  { numb: "265", type: "lecture" },
];
